CarsonGraf/382V_IoT_Graf_Seigler/TM4C123/inc/ST7735.c
#define ST7735_PWCTR1  0xC0
#define ST7735_PWCTR2  0xC1
#define ST7735_PWCTR3  0xC2
#define ST7735_PWCTR4  0xC3
#define ST7735_PWCTR5  0xC4
#define ST7735_VMCTR1  0xC5

#define ST7735_RDID1   0xDA
#define ST7735_RDID2   0xDB
#define ST7735_RDID3   0xDC
#define ST7735_RDID4   0xDD

#define ST7735_PWCTR6  0xFC

#define ST7735_GMCTRP1 0xE0
#define ST7735_GMCTRN1 0xE1

#define TFT_CS                  (*((volatile uint32_t *)0x40004020))
#define TFT_CS_LOW              0           // CS normally controlled by hardware
#define TFT_CS_HIGH             0x08
#define DC                      (*((volatile uint32_t *)0x40004100))
#define DC_COMMAND              0
#define DC_DATA                 0x40
#define RESET                   (*((volatile uint32_t *)0x40004200))
#define RESET_LOW               0
#define RESET_HIGH              0x80

#define SSI_CR0_SCR_M           0x0000FF00  // SSI Serial Clock Rate
#define SSI_CR0_SPH             0x00000080  // SSI Serial Clock Phase
#define SSI_CR0_SPO             0x00000040  // SSI Serial Clock Polarity
#define SSI_CR0_FRF_M           0x00000030  // SSI Frame Format Select
#define SSI_CR0_FRF_MOTO        0x00000000  // Freescale SPI Frame Format
#define SSI_CR0_DSS_M           0x0000000F  // SSI Data Size Select
#define SSI_CR0_DSS_8           0x00000007  // 8-bit data
#define SSI_CR1_MS              0x00000004  // SSI Master/Slave Select
#define SSI_CR1_SSE             0x00000002  // SSI Synchronous Serial Port
                                            // Enable
#define SSI_SR_BSY              0x00000010  // SSI Busy Bit
#define SSI_SR_TNF              0x00000002  // SSI Transmit FIFO Not Full
#define SSI_CPSR_CPSDVSR_M      0x000000FF  // SSI Clock Prescale Divisor
#define SSI_CC_CS_M             0x0000000F  // SSI Baud Clock Source
#define SSI_CC_CS_SYSPLL        0x00000000  // Either the system clock (if the
                                            // PLL bypass is in effect) or the
                                            // PLL output (default)
#define SYSCTL_RCGC1_SSI0       0x00000010  // SSI0 Clock Gating Control
#define SYSCTL_RCGC2_GPIOA      0x00000001  // port A Clock Gating Control
#define ST7735_TFTWIDTH  128
#define ST7735_TFTHEIGHT 160

#define ST7735_NOP     0x00
#define ST7735_SWRESET 0x01
#define ST7735_RDDID   0x04
#define ST7735_RDDST   0x09

#define ST7735_SLPIN   0x10
#define ST7735_SLPOUT  0x11
#define ST7735_PTLON   0x12
#define ST7735_NORON   0x13

#define ST7735_INVOFF  0x20
#define ST7735_INVON   0x21
#define ST7735_DISPOFF 0x28
#define ST7735_DISPON  0x29
#define ST7735_CASET   0x2A
#define ST7735_RASET   0x2B
#define ST7735_RAMWR   0x2C
#define ST7735_RAMRD   0x2E

#define ST7735_PTLAR   0x30
#define ST7735_COLMOD  0x3A
#define ST7735_MADCTL  0x36

#define ST7735_FRMCTR1 0xB1
#define ST7735_FRMCTR2 0xB2
#define ST7735_FRMCTR3 0xB3
#define ST7735_INVCTR  0xB4
#define ST7735_DISSET5 0xB6

#define ST7735_PWCTR1  0xC0
#define ST7735_PWCTR2  0xC1
#define ST7735_PWCTR3  0xC2
#define ST7735_PWCTR4  0xC3
#define ST7735_PWCTR5  0xC4
#define ST7735_VMCTR1  0xC5

#define ST7735_RDID1   0xDA
#define ST7735_RDID2   0xDB
#define ST7735_RDID3   0xDC
#define ST7735_RDID4   0xDD

#define ST7735_PWCTR6  0xFC

#define ST7735_GMCTRP1 0xE0
#define ST7735_GMCTRN1 0xE1

// standard ascii 5x7 font
// originally from glcdfont.c from Adafruit project
#define STANDARD_GALACTIC_ALPHABET 0
static const uint8_t Font[] = {
  0x00, 0x00, 0x00, 0x00, 0x00,  // NUL char =  0
  0x3E, 0x5B, 0x4F, 0x5B, 0x3E,  // SOH char =  1
  0x3E, 0x6B, 0x4F, 0x6B, 0x3E,  // STX char =  2
  0x1C, 0x3E, 0x7C, 0x3E, 0x1C,  // ETX char =  3
  0x18, 0x3C, 0x7E, 0x3C, 0x18,  // EOT char =  4
  0x1C, 0x57, 0x7D, 0x57, 0x1C,  // ENQ char =  5
  0x1C, 0x5E, 0x7F, 0x5E, 0x1C,  // ACK char =  6
  0x00, 0x18, 0x3C, 0x18, 0x00,  // BEL char =  7
  0xFF, 0xE7, 0xC3, 0xE7, 0xFF,  // BS  char =  8
  0x00, 0x18, 0x24, 0x18, 0x00,  // TAB char =  9
  0xFF, 0xE7, 0xDB, 0xE7, 0xFF,  // LF  char =  10
  0x30, 0x48, 0x3A, 0x06, 0x0E,  // VT  char =  11
  0x26, 0x29, 0x79, 0x29, 0x26,  // FF  char =  12
  0x40, 0x7F, 0x05, 0x05, 0x07,  // CR  char =  13
  0x40, 0x7F, 0x05, 0x25, 0x3F,  // SO  char =  14
  0x5A, 0x3C, 0xE7, 0x3C, 0x5A,  // SI  char =  15
  0x7F, 0x3E, 0x1C, 0x1C, 0x08,  // DLE char =  16
  0x08, 0x1C, 0x1C, 0x3E, 0x7F,  // DC1 char =  17
  0x14, 0x22, 0x7F, 0x22, 0x14,  // DC2 char =  18
  0x5F, 0x5F, 0x00, 0x5F, 0x5F,  // DC3 char =  19
  0x06, 0x09, 0x7F, 0x01, 0x7F,  // DC3 char =  20
  0x00, 0x66, 0x89, 0x95, 0x6A,  // NAK char =  21
  0x60, 0x60, 0x60, 0x60, 0x60,  // SYN char =  22
  0x94, 0xA2, 0xFF, 0xA2, 0x94,  // ETB char =  23
  0x08, 0x04, 0x7E, 0x04, 0x08,  // CAN char =  24
  0x10, 0x20, 0x7E, 0x20, 0x10,  // EM  char =  25
  0x08, 0x08, 0x2A, 0x1C, 0x08,  // SUB char =  26
  0x08, 0x1C, 0x2A, 0x08, 0x08,  // ESC char =  27
  0x1E, 0x10, 0x10, 0x10, 0x10,  // FS  char =  28
  0x0C, 0x1E, 0x0C, 0x1E, 0x0C,  // GS  char =  29
  0x30, 0x38, 0x3E, 0x38, 0x30,  // RS  char =  30
  0x06, 0x0E, 0x3E, 0x0E, 0x06,  // US  char =  31
  0x00, 0x00, 0x00, 0x00, 0x00,  // SP  char =  32
  0x00, 0x00, 0x5F, 0x00, 0x00,  // !   char =  33
  0x00, 0x07, 0x00, 0x07, 0x00,  // "   char =  34
  0x14, 0x7F, 0x14, 0x7F, 0x14,  // #   char =  35
  0x24, 0x2A, 0x7F, 0x2A, 0x12,  // $   char =  36
  0x23, 0x13, 0x08, 0x64, 0x62,  // %   char =  37
  0x36, 0x49, 0x56, 0x20, 0x50,  // &   char =  38
  0x00, 0x08, 0x07, 0x03, 0x00,  // '   char =  39
  0x00, 0x1C, 0x22, 0x41, 0x00,  // (   char =  40
  0x00, 0x41, 0x22, 0x1C, 0x00,  // )   char =  41
  0x2A, 0x1C, 0x7F, 0x1C, 0x2A,  // *   char =  42
  0x08, 0x08, 0x3E, 0x08, 0x08,  // +   char =  43
  0x00, 0x80, 0x70, 0x30, 0x00,  // ,   char =  44
  0x08, 0x08, 0x08, 0x08, 0x08,  // -   char =  45
#if STANDARD_GALACTIC_ALPHABET
  32,0,32,0,32,   // 46  dot
#else
  0x00, 0x00, 0x60, 0x60, 0x00,  // .   char =  46
#endif
  0x20, 0x10, 0x08, 0x04, 0x02,  // /  char =  47
  0x3E, 0x51, 0x49, 0x45, 0x3E,  // 0  char =  48
  0x00, 0x42, 0x7F, 0x40, 0x00,  // 1  char =  49
  0x72, 0x49, 0x49, 0x49, 0x46,  // 2  char =  50
  0x21, 0x41, 0x49, 0x4D, 0x33,  // 3  char =  51
  0x18, 0x14, 0x12, 0x7F, 0x10,  // 4  char =  52
  0x27, 0x45, 0x45, 0x45, 0x39,  // 5  char =  53
  0x3C, 0x4A, 0x49, 0x49, 0x31,  // 6  char =  54
  0x41, 0x21, 0x11, 0x09, 0x07,  // 7  char =  55
  0x36, 0x49, 0x49, 0x49, 0x36,  // 8  char =  56
  0x46, 0x49, 0x49, 0x29, 0x1E,  // 9  char =  57
  0x00, 0x00, 0x14, 0x00, 0x00,  // :  char =  58
  0x00, 0x40, 0x34, 0x00, 0x00,  // ;  char =  59
  0x00, 0x08, 0x14, 0x22, 0x41,  // <  char =  60
  0x14, 0x14, 0x14, 0x14, 0x14,  // =  char =  61
  0x00, 0x41, 0x22, 0x14, 0x08,  // >  char =  62
  0x02, 0x01, 0x59, 0x09, 0x06,  // ?  char =  63
  0x3E, 0x41, 0x5D, 0x59, 0x4E,  // @  char =  64
#if STANDARD_GALACTIC_ALPHABET
  64,126,1,1,2,     // 65  A
  64,64,79,80,96,   // 66  B
  0,29,112,0,0,     // 67  C
  10,10,18,34,34,   // 68  D
  127,64,64,64,65,  // 69  E
  20,4,20,4,20,     // 70  F
  0,8,8,127,0,      // 71  G
  5,5,125,5,5,      // 72  H
  0,0,119,0,0,      // 73  I
  0,0,107,0,0,      // 74  J
  8,0,127,0,8,      // 75  K
  0,126,0,36,0,     // 76  L
  66,64,64,64,126,  // 77  M
  0,67,32,24,7,     // 78  N
  0,65,33,25,7,     // 79  O
  0,122,0,94,0,     // 80  P
  36,36,37,36,60,   // 81  Q
  0,66,0,0,66,      // 82  R
  0,15,120,0,0,     // 83  S
  0,2,2,2,94,       // 84  T
  16,20,16,20,16,   // 85  U
  80,80,95,80,80,   // 86  V
  8,0,2,0,8,        // 87  W
  65,48,8,6,1,      // 88  X
  0,126,0,126,0,    // 89  Y
  124,2,1,2,124,    // 90  Z
#else
  0x7C, 0x12, 0x11, 0x12, 0x7C,  // A  char =  65
  0x7F, 0x49, 0x49, 0x49, 0x36,  // B  char =  66
  0x3E, 0x41, 0x41, 0x41, 0x22,  // C  char =  67
  0x7F, 0x41, 0x41, 0x41, 0x3E,  // D  char =  68
  0x7F, 0x49, 0x49, 0x49, 0x41,  // E  char =  69
  0x7F, 0x09, 0x09, 0x09, 0x01,  // F  char =  70
  0x3E, 0x41, 0x41, 0x51, 0x73,  // G  char =  71
  0x7F, 0x08, 0x08, 0x08, 0x7F,  // H  char =  72
  0x00, 0x41, 0x7F, 0x41, 0x00,  // I  char =  73
  0x20, 0x40, 0x41, 0x3F, 0x01,  // J  char =  74
  0x7F, 0x08, 0x14, 0x22, 0x41,  // K  char =  75
  0x7F, 0x40, 0x40, 0x40, 0x40,  // L  char =  76
  0x7F, 0x02, 0x1C, 0x02, 0x7F,  // M  char =  77
  0x7F, 0x04, 0x08, 0x10, 0x7F,  // N  char =  78
  0x3E, 0x41, 0x41, 0x41, 0x3E,  // O  char =  79
  0x7F, 0x09, 0x09, 0x09, 0x06,  // P  char =  80
  0x3E, 0x41, 0x51, 0x21, 0x5E,  // Q  char =  81
  0x7F, 0x09, 0x19, 0x29, 0x46,  // R  char =  82
  0x26, 0x49, 0x49, 0x49, 0x32,  // S  char =  83
  0x03, 0x01, 0x7F, 0x01, 0x03,  // T  char =  84
  0x3F, 0x40, 0x40, 0x40, 0x3F,  // U  char =  85
  0x1F, 0x20, 0x40, 0x20, 0x1F,  // V  char =  86
  0x3F, 0x40, 0x38, 0x40, 0x3F,  // W  char =  87
  0x63, 0x14, 0x08, 0x14, 0x63,  // X  char =  88
  0x03, 0x04, 0x78, 0x04, 0x03,  // Y  char =  89
  0x61, 0x59, 0x49, 0x4D, 0x43,  // Z  char =  90
#endif
  0x00, 0x7F, 0x41, 0x41, 0x41,  // [  char =  91
  0x02, 0x04, 0x08, 0x10, 0x20,  // \  char =  92
  0x00, 0x41, 0x41, 0x41, 0x7F,  // ]  char =  93
  0x04, 0x02, 0x01, 0x02, 0x04,  // ^  char =  94
  0x40, 0x40, 0x40, 0x40, 0x40,  // _  char =  95
  0x00, 0x03, 0x07, 0x08, 0x00,  // `  char =  96
#if STANDARD_GALACTIC_ALPHABET
  64,126,1,1,2,     // 65  A
  64,64,79,80,96,   // 66  B
  0,29,112,0,0,     // 67  C
  10,10,18,34,34,   // 68  D
  127,64,64,64,65,  // 69  E
  20,4,20,4,20,     // 70  F
  0,8,8,127,0,      // 71  G
  5,5,125,5,5,      // 72  H
  0,0,119,0,0,      // 73  I
  0,0,107,0,0,      // 74  J
  8,0,127,0,8,      // 75  K
  0,126,0,36,0,     // 76  L
  66,64,64,64,126,  // 77  M
  0,67,32,24,7,     // 78  N
  0,65,33,25,7,     // 79  O
  0,122,0,94,0,     // 80  P
  36,36,37,36,60,   // 81  Q
  0,66,0,0,66,      // 82  R
  0,15,120,0,0,     // 83  S
  0,2,2,2,94,       // 84  T
  16,20,16,20,16,   // 85  U
  80,80,95,80,80,   // 86  V
  8,0,2,0,8,        // 87  W
  65,48,8,6,1,      // 88  X
  0,126,0,126,0,    // 89  Y
  124,2,1,2,124,    // 90  Z
#else
  0x20, 0x54, 0x54, 0x78, 0x40,  // a  char =  97
  0x7F, 0x28, 0x44, 0x44, 0x38,  // b  char =  98
  0x38, 0x44, 0x44, 0x44, 0x28,  // c  char =  99
  0x38, 0x44, 0x44, 0x28, 0x7F,  // d  char =  100
  0x38, 0x54, 0x54, 0x54, 0x18,  // e  char =  101
  0x00, 0x08, 0x7E, 0x09, 0x02,  // f  char =  102
  0x18, 0xA4, 0xA4, 0x9C, 0x78,  // g  char =  103
  0x7F, 0x08, 0x04, 0x04, 0x78,  // h  char =  104
  0x00, 0x44, 0x7D, 0x40, 0x00,  // i  char =  105
  0x20, 0x40, 0x40, 0x3D, 0x00,  // j  char =  106
  0x7F, 0x10, 0x28, 0x44, 0x00,  // k  char =  107
  0x00, 0x41, 0x7F, 0x40, 0x00,  // l  char =  108
  0x7C, 0x04, 0x78, 0x04, 0x78,  // m  char =  109
  0x7C, 0x08, 0x04, 0x04, 0x78,  // n  char =  110
  0x38, 0x44, 0x44, 0x44, 0x38,  // o  char =  111
  0xFC, 0x18, 0x24, 0x24, 0x18,  // p  char =  112
  0x18, 0x24, 0x24, 0x18, 0xFC,  // q  char =  113
  0x7C, 0x08, 0x04, 0x04, 0x08,  // r  char =  114
  0x48, 0x54, 0x54, 0x54, 0x24,  // s  char =  115
  0x04, 0x04, 0x3F, 0x44, 0x24,  // t  char =  116
  0x3C, 0x40, 0x40, 0x20, 0x7C,  // u  char =  117
  0x1C, 0x20, 0x40, 0x20, 0x1C,  // v  char =  118
  0x3C, 0x40, 0x30, 0x40, 0x3C,  // w  char =  119
  0x44, 0x28, 0x10, 0x28, 0x44,  // x  char =  120
  0x4C, 0x90, 0x90, 0x90, 0x7C,  // y  char =  121
  0x44, 0x64, 0x54, 0x4C, 0x44,  // z  char =  122
#endif
  0x00, 0x08, 0x36, 0x41, 0x00,  // {  char =  123
  0x00, 0x00, 0x77, 0x00, 0x00,  // |  char =  124
  0x00, 0x41, 0x36, 0x08, 0x00,  // }  char =  125
  0x02, 0x01, 0x02, 0x04, 0x02,  // ~  char =  126
  0x3C, 0x26, 0x23, 0x26, 0x3C,  // DEL char =  127
  // for extended ASCII, see ExtendedASCII.png
  0x1E, 0xA1, 0xA1, 0x61, 0x12,  // char =  128
  0x3A, 0x40, 0x40, 0x20, 0x7A,  // char =  129
  0x38, 0x54, 0x54, 0x55, 0x59,  // char =  130
  0x21, 0x55, 0x55, 0x79, 0x41,  // char =  131
  0x21, 0x54, 0x54, 0x78, 0x41,  // char =  132
  0x21, 0x55, 0x54, 0x78, 0x40,  // char =  133
  0x20, 0x54, 0x55, 0x79, 0x40,  // char =  134
  0x0C, 0x1E, 0x52, 0x72, 0x12,  // char =  135
  0x39, 0x55, 0x55, 0x55, 0x59,  // char =  136
  0x39, 0x54, 0x54, 0x54, 0x59,  // char =  137
  0x39, 0x55, 0x54, 0x54, 0x58,  // char =  138
  0x00, 0x00, 0x45, 0x7C, 0x41,  // char =  139
  0x00, 0x02, 0x45, 0x7D, 0x42,  // char =  140
  0x00, 0x01, 0x45, 0x7C, 0x40,  // char =  141
  0xF0, 0x29, 0x24, 0x29, 0xF0,  // char =  142
  0xF0, 0x28, 0x25, 0x28, 0xF0,  // char =  143
  0x7C, 0x54, 0x55, 0x45, 0x00,  // char =  144
  0x20, 0x54, 0x54, 0x7C, 0x54,  // char =  145
  0x7C, 0x0A, 0x09, 0x7F, 0x49,  // char =  146
  0x32, 0x49, 0x49, 0x49, 0x32,  // char =  147
  0x32, 0x48, 0x48, 0x48, 0x32,  // char =  148
  0x32, 0x4A, 0x48, 0x48, 0x30,  // char =  149
  0x3A, 0x41, 0x41, 0x21, 0x7A,  // char =  150
  0x3A, 0x42, 0x40, 0x20, 0x78,  // char =  151
  0x00, 0x9D, 0xA0, 0xA0, 0x7D,  // char =  152
  0x39, 0x44, 0x44, 0x44, 0x39,  // char =  153
  0x3D, 0x40, 0x40, 0x40, 0x3D,  // char =  154
  0x3C, 0x24, 0xFF, 0x24, 0x24,  // char =  155
  0x48, 0x7E, 0x49, 0x43, 0x66,  // char =  156
  0x2B, 0x2F, 0xFC, 0x2F, 0x2B,  // char =  157
  0xFF, 0x09, 0x29, 0xF6, 0x20,  // char =  158
  0xC0, 0x88, 0x7E, 0x09, 0x03,  // char =  159
  0x20, 0x54, 0x54, 0x79, 0x41,  // char =  160
  0x00, 0x00, 0x44, 0x7D, 0x41,  // char =  161
  0x30, 0x48, 0x48, 0x4A, 0x32,  // char =  162
  0x38, 0x40, 0x40, 0x22, 0x7A,  // char =  163
  0x00, 0x7A, 0x0A, 0x0A, 0x72,  // char =  164
  0x7D, 0x0D, 0x19, 0x31, 0x7D,  // char =  165
  0x26, 0x29, 0x29, 0x2F, 0x28,  // char =  166
  0x26, 0x29, 0x29, 0x29, 0x26,  // char =  167
  0x30, 0x48, 0x4D, 0x40, 0x20,  // char =  168
  0x38, 0x08, 0x08, 0x08, 0x08,  // char =  169
  0x08, 0x08, 0x08, 0x08, 0x38,  // char =  170
  0x2F, 0x10, 0xC8, 0xAC, 0xBA,  // char =  171
  0x2F, 0x10, 0x28, 0x34, 0xFA,  // char =  172
  0x00, 0x00, 0x7B, 0x00, 0x00,  // char =  173
  0x08, 0x14, 0x2A, 0x14, 0x22,  // char =  174
  0x22, 0x14, 0x2A, 0x14, 0x08,  // char =  175
  0xAA, 0x00, 0x55, 0x00, 0xAA,  // char =  176
  0xAA, 0x55, 0xAA, 0x55, 0xAA,  // char =  177
  0x00, 0x00, 0x00, 0xFF, 0x00,  // char =  178
  0x10, 0x10, 0x10, 0xFF, 0x00,  // char =  179
  0x14, 0x14, 0x14, 0xFF, 0x00,  // char =  180
  0x10, 0x10, 0xFF, 0x00, 0xFF,  // char =  181
  0x10, 0x10, 0xF0, 0x10, 0xF0,  // char =  182
  0x14, 0x14, 0x14, 0xFC, 0x00,  // char =  183
  0x14, 0x14, 0xF7, 0x00, 0xFF,  // char =  184
  0x00, 0x00, 0xFF, 0x00, 0xFF,  // char =  185
  0x14, 0x14, 0xF4, 0x04, 0xFC,  // char =  186
  0x14, 0x14, 0x17, 0x10, 0x1F,  // char =  187
  0x10, 0x10, 0x1F, 0x10, 0x1F,  // char =  188
  0x14, 0x14, 0x14, 0x1F, 0x00,  // char =  189
  0x10, 0x10, 0x10, 0xF0, 0x00,  // char =  190
  0x00, 0x00, 0x00, 0x1F, 0x10,  // char =  191
  0x10, 0x10, 0x10, 0x1F, 0x10,  // char =  192
  0x10, 0x10, 0x10, 0xF0, 0x10,  // char =  193
  0x00, 0x00, 0x00, 0xFF, 0x10,  // char =  194
  0x10, 0x10, 0x10, 0x10, 0x10,  // char =  195
  0x10, 0x10, 0x10, 0xFF, 0x10,  // char =  196
  0x00, 0x00, 0x00, 0xFF, 0x14,  // char =  197
  0x00, 0x00, 0xFF, 0x00, 0xFF,  // char =  198
  0x00, 0x00, 0x1F, 0x10, 0x17,  // char =  199
  0x00, 0x00, 0xFC, 0x04, 0xF4,  // char =  200
  0x14, 0x14, 0x17, 0x10, 0x17,  // char =  201
  0x14, 0x14, 0xF4, 0x04, 0xF4,  // char =  202
  0x00, 0x00, 0xFF, 0x00, 0xF7,  // char =  203
  0x14, 0x14, 0x14, 0x14, 0x14,  // char =  204
  0x14, 0x14, 0xF7, 0x00, 0xF7,  // char =  205
  0x14, 0x14, 0x14, 0x17, 0x14,  // char =  206
  0x10, 0x10, 0x1F, 0x10, 0x1F,  // char =  207
  0x14, 0x14, 0x14, 0xF4, 0x14,  // char =  208
  0x10, 0x10, 0xF0, 0x10, 0xF0,  // char =  209
  0x00, 0x00, 0x1F, 0x10, 0x1F,  // char =  210
  0x00, 0x00, 0x00, 0x1F, 0x14,  // char =  211
  0x00, 0x00, 0x00, 0xFC, 0x14,  // char =  212
  0x00, 0x00, 0xF0, 0x10, 0xF0,  // char =  213
  0x10, 0x10, 0xFF, 0x10, 0xFF,  // char =  214
  0x14, 0x14, 0x14, 0xFF, 0x14,  // char =  215
  0x10, 0x10, 0x10, 0x1F, 0x00,  // char =  216
  0x00, 0x00, 0x00, 0xF0, 0x10,  // char =  217
  0xFF, 0xFF, 0xFF, 0xFF, 0xFF,  // char =  218
  0xF0, 0xF0, 0xF0, 0xF0, 0xF0,  // char =  219
  0xFF, 0xFF, 0xFF, 0x00, 0x00,  // char =  220
  0x00, 0x00, 0x00, 0xFF, 0xFF,  // char =  221
  0x0F, 0x0F, 0x0F, 0x0F, 0x0F,  // char =  222
  0x38, 0x44, 0x44, 0x38, 0x44,  // char =  223
  0x7C, 0x2A, 0x2A, 0x3E, 0x14,  // char =  224
  0x7E, 0x02, 0x02, 0x06, 0x06,  // char =  225
  0x02, 0x7E, 0x02, 0x7E, 0x02,  // char =  226
  0x63, 0x55, 0x49, 0x41, 0x63,  // char =  227
  0x38, 0x44, 0x44, 0x3C, 0x04,  // char =  228
  0x40, 0x7E, 0x20, 0x1E, 0x20,  // char =  229
  0x06, 0x02, 0x7E, 0x02, 0x02,  // char =  230
  0x99, 0xA5, 0xE7, 0xA5, 0x99,  // char =  231
  0x1C, 0x2A, 0x49, 0x2A, 0x1C,  // char =  232
  0x4C, 0x72, 0x01, 0x72, 0x4C,  // char =  233
  0x30, 0x4A, 0x4D, 0x4D, 0x30,  // char =  234
  0x30, 0x48, 0x78, 0x48, 0x30,  // char =  235
  0xBC, 0x62, 0x5A, 0x46, 0x3D,  // char =  236
  0x3E, 0x49, 0x49, 0x49, 0x00,  // char =  237
  0x7E, 0x01, 0x01, 0x01, 0x7E,  // char =  238
  0x2A, 0x2A, 0x2A, 0x2A, 0x2A,  // char =  239
  0x44, 0x44, 0x5F, 0x44, 0x44,  // char =  240
  0x40, 0x51, 0x4A, 0x44, 0x40,  // char =  241
  0x40, 0x44, 0x4A, 0x51, 0x40,  // char =  242
  0x00, 0x00, 0xFF, 0x01, 0x03,  // char =  243
  0xE0, 0x80, 0xFF, 0x00, 0x00,  // char =  244
  0x08, 0x08, 0x6B, 0x6B, 0x08,  // char =  245
  0x36, 0x12, 0x36, 0x24, 0x36,  // char =  246
  0x06, 0x0F, 0x09, 0x0F, 0x06,  // char =  247
  0x00, 0x00, 0x18, 0x18, 0x00,  // char =  248
  0x00, 0x00, 0x10, 0x10, 0x00,  // char =  249
  0x30, 0x40, 0xFF, 0x01, 0x01,  // char =  250
  0x00, 0x1F, 0x01, 0x01, 0x1E,  // char =  251
  0x00, 0x19, 0x1D, 0x17, 0x12,  // char =  252
  0x00, 0x3C, 0x3C, 0x3C, 0x3C,  // char =  253
  0x00, 0x00, 0x00, 0x00, 0x00,  // char =  254

