CarsonGraf/382V_IoT_Graf_Seigler/TM4C123/inc/ST7735.c
//********ST7735_OutUFix2*****************
// Output a 32-bit number in unsigned 4-digit fixed point, 0.01 resolution
// numbers 0 to 9999 printed as " 0.00" to "99.99"
// Inputs: n  32-bit signed number
// Outputs: none
void ST7735_OutUFix2(int32_t n){
  char message[8];
  if(n>9999){
      message[0] = '*';
      message[1] = '*';
      message[2] = '.';
      message[3] = '*';
      message[4] = '*';
    }else if(n<0){
      message[0] = '-';
      message[1] = '*';
      message[2] = '.';
      message[3] = '*';
      message[4] = '*';
    }else{
        if(n>=1000){  // 1000 to 9999
      message[0] = (n/1000+'0'); /* tens digit */
      n = n%1000; //the rest
    }else { // 0 to 999
      message[0] = ' '; /* n is between 0.0 and 9.9 */
    }
    message[1] = (n/100+'0'); /* ones digit */
    n = n%100; //the rest
    message[2] = '.';
    message[3] = (n/10+'0'); /* tenths digit */
    n = n%10; //the rest
    message[4] = (n+'0');    /* hundreds digit */
    }
  message[5] = 0;
  ST7735_OutString(message);
}
//********ST7735_OutSFix1_1j*****************
// Output a 16-bit number in signed 2-digit fixed point, 0.1 resolution
// numbers -99 to 99 printed as "-9.9j" to "+9.9j"
// Inputs: n  32-bit signed number
// Outputs: none
void ST7735_OutSFix1_1j(int32_t n){
  char message[8];
  if(n<-99) n=-99;
  if(n>99)  n=99;
  if(n<0){
    message[0] = '-';
    n = -n; // now positive
  }else{
    message[0] = '+';
  }
  message[1] = (n/10+'0'); /* ones digit */
  message[2] = '.';
  n = n%10; //the rest
  message[3] = (n+'0'); /* tenths digit */
  message[4] = 'j';
  message[5] = 0;
  ST7735_OutString(message);
}




#define MADCTL_MY  0x80
#define MADCTL_MX  0x40
#define MADCTL_MV  0x20
#define MADCTL_ML  0x10
#define MADCTL_RGB 0x00
#define MADCTL_BGR 0x08
#define MADCTL_MH  0x04

//------------ST7735_SetRotation------------
// Change the image rotation.
// Requires 2 bytes of transmission
// Input: m new rotation value (0 to 3)
// Output: none
void ST7735_SetRotation(uint8_t m) {

  writecommand(ST7735_MADCTL);
  Rotation = m % 4; // can't be higher than 3
  switch (Rotation) {
   case 0:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MX | MADCTL_MY | MADCTL_RGB);
     } else {
       writedata(MADCTL_MX | MADCTL_MY | MADCTL_BGR);
     }
     _width  = ST7735_TFTWIDTH;
     _height = ST7735_TFTHEIGHT;
     break;
   case 1:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MY | MADCTL_MV | MADCTL_RGB);
     } else {
       writedata(MADCTL_MY | MADCTL_MV | MADCTL_BGR);
     }
     _width  = ST7735_TFTHEIGHT;
     _height = ST7735_TFTWIDTH;
     break;
  case 2:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_RGB);
     } else {
       writedata(MADCTL_BGR);
     }
     _width  = ST7735_TFTWIDTH;
     _height = ST7735_TFTHEIGHT;
    break;
   case 3:
     if (TabColor == INITR_BLACKTAB) {
       writedata(MADCTL_MX | MADCTL_MV | MADCTL_RGB);
     } else {
       writedata(MADCTL_MX | MADCTL_MV | MADCTL_BGR);
     }
     _width  = ST7735_TFTHEIGHT;
     _height = ST7735_TFTWIDTH;
     break;
  }

  deselect();
}


//------------ST7735_InvertDisplay------------
// Send the command to invert all of the colors.
// Requires 1 byte of transmission
// Input: i 0 to disable inversion; non-zero to enable inversion
// Output: none
void ST7735_InvertDisplay(int i) {
  if(i){
    writecommand(ST7735_INVON);
  } else{
    writecommand(ST7735_INVOFF);
  }  
  deselect();
}
// graphics routines
// y coordinates 0 to 31 used for labels and messages
// y coordinates 32 to 159  128 pixels high
// x coordinates 0 to 127   128 pixels wide

#define jmin    40
#define jmin2   109
#define jscale  (159-jmin)
#define jscale2 (159-jmin2)
int32_t Ymax,Ymin,X;    // X goes from 0 to 127
int32_t Ymax2,Ymin2;    // second point scale
int32_t Yrange,Yrange2; //YrangeDiv2;

// *************** ST7735_PlotClear ********************
// Clear the graphics buffer, set X coordinate to 0
// This routine clears the display
// Inputs: ymin and ymax are range of the plot
// Outputs: none
void ST7735_PlotClear(int32_t ymin, int32_t ymax){
  ST7735_FillRect(0, 32, 128, 128, ST7735_Color565(228,228,228)); // light grey
  if(ymax>ymin){
    Ymax = ymax;
    Ymin = ymin;
    Yrange = ymax-ymin;
  } else{
    Ymax = ymin;
    Ymin = ymax;
    Yrange = ymax-ymin;
  }
  //YrangeDiv2 = Yrange/2;
  X = 0;
}
// *************** ST7735_PlotClear2 ********************
// Clear the graphics buffer, set X coordinate to 0
// This routine clears the display
// Inputs: ymin and ymax are range of the plot
// Outputs: none
void ST7735_PlotClear2(int32_t ymin, int32_t ymax,int32_t ymin2, int32_t ymax2){
  ST7735_FillRect(0, jmin, 128, 128, PLOT_BACKGROUND);
  if(ymax>ymin){
    Ymax = ymax;
    Ymin = ymin;
    Yrange = ymax-ymin;
  } else{
    Ymax = ymin;
    Ymin = ymax;
    Yrange = ymax-ymin;
  }
  if(ymax2>ymin2){
    Ymax2 = ymax2;
    Ymin2 = ymin2;
    Yrange2 = ymax2-ymin2;
  } else{
    Ymax2 = ymin2;
    Ymin2 = ymax2;
    Yrange2 = ymax2-ymin2;
  }
  //YrangeDiv2 = Yrange/2;
  X = 0;
}
// *************** ST7735_PlotRescale2 ********************
// Set X coordinate to 0
// This routine does not clear the display
// Inputs: ymin and ymax are range of the plot
// Outputs: none
void ST7735_PlotRescale2(int32_t ymin, int32_t ymax,int32_t ymin2, int32_t ymax2){
  if(ymax>ymin){
    Ymax = ymax;
    Ymin = ymin;
    Yrange = ymax-ymin;
  } else{
    Ymax = ymin;
    Ymin = ymax;
    Yrange = ymax-ymin;
  }
  if(ymax2>ymin2){
    Ymax2 = ymax2;
    Ymin2 = ymin2;
    Yrange2 = ymax2-ymin2;
  } else{
    Ymax2 = ymin2;
    Ymin2 = ymax2;
    Yrange2 = ymax2-ymin2;
  }
  X = 0;
}

// *************** ST7735_PlotPoint ********************
// Used in the voltage versus time plot, plot one point at y
// It does output to display
// Inputs: y is the y coordinate of the point plotted
// Outputs: none
void ST7735_PlotPoint(int32_t y){int32_t j;
  if(y<Ymin) y=Ymin;
  if(y>Ymax) y=Ymax;
  // X goes from 0 to 127
  // j goes from 159 to 32
  // y=Ymax maps to j=32
  // y=Ymin maps to j=159
  j = 32+(127*(Ymax-y))/Yrange;
  if(j<32) j = 32;
  if(j>159) j = 159;
  ST7735_DrawPixel(X,   j,   ST7735_BLUE);
  ST7735_DrawPixel(X+1, j,   ST7735_BLUE);
  ST7735_DrawPixel(X,   j+1, ST7735_BLUE);
  ST7735_DrawPixel(X+1, j+1, ST7735_BLUE);
}
// *************** ST7735_PlotLine ********************
// Used in the voltage versus time plot, plot line to new point
// It does output to display
// Inputs: y is the y coordinate of the point plotted
// Outputs: none
int32_t lastj=0;
void ST7735_PlotLine(int32_t y){int32_t i,j;
  if(y<Ymin) y=Ymin;
  if(y>Ymax) y=Ymax;
  // X goes from 0 to 127
  // j goes from 159 to 32
  // y=Ymax maps to j=32
  // y=Ymin maps to j=159
  j = 32+(127*(Ymax-y))/Yrange;
  if(j < 32) j = 32;
  if(j > 159) j = 159;
  if(lastj < 32) lastj = j;
  if(lastj > 159) lastj = j;
  if(lastj < j){
    for(i = lastj+1; i<=j ; i++){
      ST7735_DrawPixel(X,   i,   ST7735_BLUE) ;
      ST7735_DrawPixel(X+1, i,   ST7735_BLUE) ;
    }
  }else if(lastj > j){
    for(i = j; i<lastj ; i++){
      ST7735_DrawPixel(X,   i,   ST7735_BLUE) ;
      ST7735_DrawPixel(X+1, i,   ST7735_BLUE) ;
    }
  }else{
    ST7735_DrawPixel(X,   j,   ST7735_BLUE) ;
    ST7735_DrawPixel(X+1, j,   ST7735_BLUE) ;
  }
  lastj = j;
}

// *************** ST7735_PlotPoints ********************
// Used in the voltage versus time plot, plot two points at y1, y2
// It does output to display
// Inputs: y1 is the y coordinate of the first point plotted
//         y2 is the y coordinate of the second point plotted
// Outputs: none
void ST7735_PlotPoints(int32_t y1,int32_t y2){int32_t j;
  if(y1<Ymin) y1=Ymin;
  if(y1>Ymax) y1=Ymax;
  // X goes from 0 to 127
  // j goes from 159 to 32
  // y=Ymax maps to j=32
  // y=Ymin maps to j=159
  j = 32+(127*(Ymax-y1))/Yrange;
  if(j<32) j = 32;
  if(j>159) j = 159;
  ST7735_DrawPixel(X, j, ST7735_BLUE);
  if(y2<Ymin) y2=Ymin;
  if(y2>Ymax) y2=Ymax;
  j = 32+(127*(Ymax-y2))/Yrange;
  if(j<32) j = 32;
  if(j>159) j = 159;
  ST7735_DrawPixel(X, j, ST7735_BLACK);
}
// *************** ST7735_PlotPoints2 ********************
// Used in the voltage versus time plot, plot two points at y1, y2
// It does output to display
// Inputs: y1 is the y coordinate of the first point plotted
//         y2 is the y coordinate of the second point plotted
// Outputs: none
void ST7735_PlotPoints2(int32_t y1,int32_t y2){int32_t j;
  if(y1<Ymin) y1=Ymin;
  if(y1>Ymax) y1=Ymax;
  // X goes from 0 to 127
  // j goes from 159 to jmin
  // y=Ymax maps to j=jmin
  // y=Ymin maps to j=159
  j = jmin+(jscale*(Ymax-y1))/Yrange;
  if(j<jmin) j = jmin;
  if(j>158) j = 158;
  ST7735_DrawPixel(X, j, PLOT_COLOR1);
  ST7735_DrawPixel(X, j+1, PLOT_COLOR1);
  if(y2<Ymin2) y2=Ymin2;
  if(y2>Ymax2) y2=Ymax2;
  // j2 goes from 159 to jmin2
  // y=Ymax2 maps to j=jmin2
  // y=Ymin2 maps to j=159
  j = jmin2+(jscale2*(Ymax2-y2))/Yrange2;
  if(j<jmin2) j = jmin2;
  if(j>159) j = 159;
  ST7735_DrawPixel(X, j, PLOT_COLOR2);
}

// *************** ST7735_PlotBar ********************
// Used in the voltage versus time bar, plot one bar at y
// It does not output to display until RIT128x96x4ShowPlot called
// Inputs: y is the y coordinate of the bar plotted
// Outputs: none
void ST7735_PlotBar(int32_t y){
int32_t j;
  if(y<Ymin) y=Ymin;
  if(y>Ymax) y=Ymax;
  // X goes from 0 to 127
  // j goes from 159 to 32
  // y=Ymax maps to j=32
  // y=Ymin maps to j=159
  j = 32+(127*(Ymax-y))/Yrange;
  ST7735_DrawFastVLine(X, j, 159-j, ST7735_BLACK);

